
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;hmc_cft_hearing_service&#34;]
  * module.postgresql_v15_replica[0].azurerm_resource_group.rg[0]
  * module.postgresql_v15_replica[0].null_resource.set-user-permissions-additionaldbs[&#34;hmc_cft_hearing_service&#34;]
* Replace
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "hmc-cft-hearing-service-postgres-db-v15-replica-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmc-cft-hearing-service-postgres-db-v15-replica-aat" -> (known after apply)
      ~ name                          = "hmc-cft-hearing-service-postgres-db-v15-replica-aat" -> "hmc-cft-hearing-service-postgres-db-v15-aat" # forces replacement
      ~ public_network_access_enabled = false -> (known after apply)
      ~ storage_tier                  = "P6" -> (known after apply)
        tags                          = {
            "application"         = "core-case-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmc-cft-hearing-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
      - zone                          = "2" -> null
        # (15 unchanged attributes hidden)

      + high_availability {
          + mode = "ZoneRedundant"
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "hmc-cft-hearing-service-postgres-db-v15-data-aat"
      + server_name         = "hmc-cft-hearing-service-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "hmc-cft-hearing-service-postgres-db-v15-data-aat"
      + server_name         = "hmc-cft-hearing-service-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmc-cft-hearing-service-postgres-db-v15-replica-aat/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmc-cft-hearing-service-postgres-db-v15-replica-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_database.pg_databases["hmc_cft_hearing_service"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "hmc_cft_hearing_service"
      + server_id = (known after apply)
    }

  # module.postgresql_v15_replica[0].azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "hmc-cft-hearing-service-postgres-db-v15-data-aat"
      + tags     = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmc-cft-hearing-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd_support"
          + "environment"         = "staging"
          + "managedBy"           = "CDM"
        }
    }

  # module.postgresql_v15_replica[0].null_resource.set-user-permissions-additionaldbs["hmc_cft_hearing_service"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "hmc-cft-hearing-service-postgres-db-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 7 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":480,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->